In [1]:
import pandas as pd
import pickle
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt
import math
import numpy as np

In [2]:
may = pd.read_csv('../data/may.csv/may.csv')

In [3]:
may.sumdgroup.unique()

array(['scooter', 'Scooter', 'bicycle'], dtype=object)

In [4]:
may_scooters = may.loc[may.sumdgroup.isin(['scooter', 'Scooter'])]

In [5]:
may_scooters = may_scooters[[ 'companyname', 'sumdid', 'chargelevel','pubdatetime', 'latitude', 'longitude']]

In [6]:
may_scooters.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20283582 entries, 0 to 20292502
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   companyname  object
 1   sumdid       object
 2   chargelevel  float64
 3   pubdatetime  object
 4   latitude     float64
 5   longitude    float64
dtypes: float64(3), object(3)
memory usage: 1.1+ GB

In [7]:
may_scooters.to_pickle("../data/may.pkl")

In [8]:
may_scooters.pubdatetime = pd.to_datetime(may_scooters.pubdatetime)

In [76]:
may_scooters.head()

,companyname,sumdid,chargelevel,pubdatetime,latitude,longitude,date,hour,minute
0,Bird,PoweredLIRL1,93.0,2019-05-01 00:01:41.247,36.136822,-86.799877,2019-05-01,0,1
1,Bird,PoweredXWRWC,35.0,2019-05-01 00:01:41.247,36.191252,-86.772945,2019-05-01,0,1
2,Bird,PoweredMEJEH,90.0,2019-05-01 00:01:41.247,36.144752,-86.806293,2019-05-01,0,1
3,Bird,Powered1A7TC,88.0,2019-05-01 00:01:41.247,36.162056,-86.774688,2019-05-01,0,1
4,Bird,Powered2TYEF,98.0,2019-05-01 00:01:41.247,36.150973,-86.783109,2019-05-01,0,1

In [9]:
may_scooters.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20283582 entries, 0 to 20292502
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   companyname  object
 1   sumdid       object
 2   chargelevel  float64
 3   pubdatetime  datetime64[ns]
 4   latitude     float64
 5   longitude    float64
dtypes: datetime64[ns](1), float64(3), object(2)
memory usage: 1.1+ GB

In [10]:
may_scooters['date'] = may_scooters['pubdatetime'].dt.date

In [11]:
may_scooters.date = pd.to_datetime(may_scooters.date)

To round down to closest 15, this should work

15 * math.floor(number/15)

In [12]:
may_scooters.isnull().sum()

companyname      0
sumdid           0
chargelevel    283
pubdatetime      0
latitude         0
longitude        0
date             0
dtype: int64

In [13]:
may_scooters = may_scooters.dropna()

In [14]:
may_scooters

,companyname,sumdid,chargelevel,pubdatetime,latitude,longitude,date
0,Bird,PoweredLIRL1,93.0,2019-05-01 00:01:41.247,36.136822,-86.799877,2019-05-01
1,Bird,PoweredXWRWC,35.0,2019-05-01 00:01:41.247,36.191252,-86.772945,2019-05-01
2,Bird,PoweredMEJEH,90.0,2019-05-01 00:01:41.247,36.144752,-86.806293,2019-05-01
3,Bird,Powered1A7TC,88.0,2019-05-01 00:01:41.247,36.162056,-86.774688,2019-05-01
4,Bird,Powered2TYEF,98.0,2019-05-01 00:01:41.247,36.150973,-86.783109,2019-05-01
...,...,...,...,...,...,...,...
20292498,Jump,Poweredbb60ef04-c719-597f-805f-20978964fd8c,49.0,2019-05-31 23:59:42.000,36.163900,-86.782300,2019-05-31
20292499,Jump,Powered9f5743ed-7f81-539b-9e37-6503d54445d3,68.0,2019-05-31 23:59:42.000,36.160600,-86.776800,2019-05-31
20292500,Jump,Powered5744d1db-3bbe-55e5-9a23-a93828ba54fc,53.0,2019-05-31 23:59:42.000,36.160600,-86.776900,2019-05-31
20292501,Jump,Poweredad1d6d3b-162a-5bec-bffd-cac4ac8dee1c,42.0,2019-05-31 23:59:42.000,36.162400,-86.774500,2019-05-31
20292502,Jump,Powered8505008e-97c9-5003-8975-2ea6b2634fa0,76.0,2019-05-31 23:59:42.000,36.151900,-86.798500,2019-05-31

In [15]:
may_scooters.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20283299 entries, 0 to 20292502
Data columns (total 7 columns):
 #   Column       Dtype
---  ------       -----
 0   companyname  object
 1   sumdid       object
 2   chargelevel  float64
 3   pubdatetime  datetime64[ns]
 4   latitude     float64
 5   longitude    float64
 6   date         datetime64[ns]
dtypes: datetime64[ns](2), float64(3), object(2)
memory usage: 1.2+ GB

In [16]:
may_scooters['date'] = may_scooters['pubdatetime'].dt.date

In [17]:
may_scooters['hour'] = may_scooters['pubdatetime'].dt.hour

In [18]:
may_scooters['minute'] = may_scooters['pubdatetime'].dt.minute

In [19]:
may_scooters.head()

,companyname,sumdid,chargelevel,pubdatetime,latitude,longitude,date,hour,minute
0,Bird,PoweredLIRL1,93.0,2019-05-01 00:01:41.247,36.136822,-86.799877,2019-05-01,0,1
1,Bird,PoweredXWRWC,35.0,2019-05-01 00:01:41.247,36.191252,-86.772945,2019-05-01,0,1
2,Bird,PoweredMEJEH,90.0,2019-05-01 00:01:41.247,36.144752,-86.806293,2019-05-01,0,1
3,Bird,Powered1A7TC,88.0,2019-05-01 00:01:41.247,36.162056,-86.774688,2019-05-01,0,1
4,Bird,Powered2TYEF,98.0,2019-05-01 00:01:41.247,36.150973,-86.783109,2019-05-01,0,1

In [20]:
may_scooters.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20283299 entries, 0 to 20292502
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   companyname  object
 1   sumdid       object
 2   chargelevel  float64
 3   pubdatetime  datetime64[ns]
 4   latitude     float64
 5   longitude    float64
 6   date         object
 7   hour         int64
 8   minute       int64
dtypes: datetime64[ns](1), float64(3), int64(2), object(3)
memory usage: 1.5+ GB

In [21]:
may_scooters['roundedtime']= 15*math.floor(may_scooters['minute']/15)

TypeError: cannot convert the series to <class 'float'>

In [90]:
np.apply(15*math.floor(['minute']/15))

AttributeError: module 'numpy' has no attribute 'apply'

In [92]:
floored_data = may_scooters['minute'].apply(15*math.floor)

TypeError: unsupported operand type(s) for *: 'int' and 'builtin_function_or_method'

In [63]:
floored_data

0            1
1            1
2            1
3            1
4            1
            ..
20292498    59
20292499    59
20292500    59
20292501    59
20292502    59
Name: minute, Length: 20283299, dtype: int64

In [21]:
may_scooters.companyname.value_counts()

Lime      7111655
Bird      4334006
Lyft      3112581
Jump      2984630
Spin      1301001
Gotcha     915314
Bolt       524395
Name: companyname, dtype: int64

may_scooters = may_scooters[['sumdid', 'companyname','date','time','latitude', 'longitude', 'chargelevel']]

In [69]:
may_scooters.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20283299 entries, 0 to 20292502
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   companyname  object
 1   sumdid       object
 2   chargelevel  float64
 3   pubdatetime  datetime64[ns]
 4   latitude     float64
 5   longitude    float64
 6   date         object
 7   hour         int64
 8   minute       int64
dtypes: datetime64[ns](1), float64(3), int64(2), object(3)
memory usage: 1.5+ GB

bird_scooters_may = may_scooters.loc[may_scooters['companyname'] == 'Bird'].sum()
df.pivot(index='foo', columns='bar', values='baz')

In [23]:
pivot = pd.pivot_table(may_scooters, index ='companyname', values = 'sumdid', aggfunc ='count', margins = True)
pivot

               sumdid
companyname
Bird          4334006
Bolt           524395
Gotcha         915314
Jump          2984630
Lime          7111655
Lyft          3112581
Spin          1301001
All          20283582

In [25]:
may_scooters = may_scooters.dropna()